models/tmr/bump/coarse/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}


application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         4000;
deltaT          1;
writeControl    timeStep;
writeInterval   4000;
purgeWrite      2;
writeFormat     ascii;
writePrecision  10;
timeFormat      general;
timePrecision   6;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        patches         (bump);
        rho             rhoInf;
        rhoInf          1.0;
        magUInf         1.0;
        lRef            1.5;
        Aref            1.5;
        CofR            (0 0 0);
        dragDir         (1 0 0);
        liftDir         (0 1 0);
        pitchAxis       (0 0 1);
    }
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        executeControl  onEnd;
        writeControl    onEnd;
    }
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        patches         (bump);
        executeControl  onEnd;
        writeControl    onEnd;
    }
    wallCf
    {
        type            surfaces;
        libs            (sampling);
        executeControl  onEnd;
        writeControl    onEnd;
        surfaceFormat   raw;
        fields          (wallShearStress);
        interpolate     false;
        surfaces
        (
            bump { type patch; patches (bump); }
        );
    }
}
